# IFC_AttachPset

## Description
Attaches a property set to the object

```pascal
FUNCTION IFC_AttachPset(
				hObject       : HANDLE;
				inStrPsetName : STRING) : BOOLEAN;
```

```python

def vs.IFC_AttachPset(hObject, inStrPsetName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|inStrPsetName|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* IFC